<template>
    <div class="container">
        <br>
        <div class="columns is-multiline ml-2 mr-2">
            <div class="column is-3" v-for="time in drink_time" :key="time.index">
                <div class="card">
                    <div class="card-image">
                        <figure class="image is-5by4">
                            <img :src="time.image">
                        </figure>
                    </div>

                    <div class="card-content">
                        <div class="content">
                            <h1 class="has-text-centered title is-3">{{ time.title }}</h1>
                            <h3 class="title is-4">{{ time.subtitle }}</h3>
                            <p>
                                {{ time.content }}
                            </p>
                        </div>
                    </div>
                </div>
            </div>
        </div>

        <footer class="footer">
            <div class="content has-text-centered">
                <p>
                    <strong>แม้ว่าการดื่มน้ำจะสำคัญต่อสุขภาพมากสักแค่ไหนแต่ถ้าเราดื่มในปริมาณที่มากเกินไปครั้งเดียวก็อาจจะส่งผลร้ายต่อร่างกายได้เช่นกัน ดังนั้น ค่อยๆจิบระหว่างวันไปเรื่อยๆจะช่วยให้การดื่มน้ำของเรานั้นมีประสิทธิภาพมากกว่า</strong>
                    <br>
                    <a href="https://www.youtube.com/watch?v=ZCp80EYnScc&t=900s">ที่มาของข้อมูล Doctor Top</a>
                </p>
            </div>
        </footer>
    </div>
</template>

<script>
    export default{
        name: "HomeView",
        data(){
            return{
                drink_time:[
                    {
                        title: "ช่วงเวลาที่ 1",
                        subtitle: "หลังตื่นนอน",
                        content: "ช่วงเวลาที่ 1 จะเป็นช่วงตื่นนอนตอนเช้า เพราะตลอดเวลาที่เราหลับยาวนานกว่า 6-8 ชั่วโมงร่างกายของเราไม่ได้ดื่มน้ำแม้แต่หยดเดียว ส่งผลให้มีอาการมึนๆ งงๆ เวียนหัว ทั้งที่ก็นอนได้เต็มอิ่ม ซึ่งที่เป็นแบบนั้นเพราะว่าร่างกายเกิดสภาวะขาดน้ำอย่างหนัก ควรดื่มน้ำ 1 แก้วหรือประมาณ 200 cc (1 cc เท่ากับ 1 มิลลิลิตร) เพื่อให้ร่างกายสดชื่น",
                        image: "https://i.imgur.com/sUsNCHJ.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 2",
                        subtitle: "ขณะ/หรือหลังออกกำลังกาย",
                        content: "ควรดื่มเป็นเพียงการจิบน้ำตลอดการออกกำลังกาย เพื่อไม่ให้ร่างกายเกิดสภาวะขาดน้ำ จิบเพียงเล็กน้อยให้พอชุ่มคอไม่ต้องรอให้กระหายถ้าทำแบบนี้เป็นประจำการออกกำลังกายจะมีประสิทธิภาพเพิ่มขึ้นจากเดิม อีกทั้งอาการหน้ามืดเป็นลมจะมีโอกาสเกิดน้อยมากๆ",
                        image: "https://i.imgur.com/rrg3h0h.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 3",
                        subtitle: "ครึ่งชั่วโมงก่อนระบประทานอาหาร",
                        content: "การดื่มน้ำก่อนรับประทานอาหารสักครึ่งชั่วโมงจะเป็นการกระตุ้นร่างกายว่า เรากำลังจะรับประทานอาหารเข้าไปแล้วนะ เพื่อให้ระบบย่อยอาหารเตรียมพร้อมการทำงานและสามารถย่อยอาหารได้อย่างมีประสิทธิภาพมากขึ้น อีกทั้งการดื่มน้ำก่อนรับประทานอาหารอาจจะช่วยให้มีความอยากอาหารที่น้อยลง แต่ไม่ใช่ดื่มจนอิ่มเอาแค่พอดีๆ วิธีนี้จึงเป็นอีกหนึ่งวิธีที่กลุ่มคนลดน้ำหนักมักใช้กันเป็นประจำ",
                        image: "https://i.imgur.com/P5kPOgS.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 4",
                        subtitle: "ก่อนอาบน้ำ",
                        content: "เหมาะกับผู้ชอบอาบน้ำอุ่นหรือน้ำร้อน เพราะเมื่อไรที่ร่างกายของคนเราโดนน้ำร้อน เลือดก็จะไหลเวียนไปที่ผิวหนังเยอะและส่งผลทำให้เลือดไปเลี้ยงสมองน้อยลง ซึ่งอาจจะทำให้เกิดสภาวะความดันตกได้ ฉะนั้นการดื่มน้ำ 200 cc - 300 cc ก่อนอาบน้ำก็จะช่วยลดการเกิดอาการเวียนหัวได้เป็นอย่างดีและปัญหาหน้ามืดหลังอาบน้ำเสร็จก็จะไม่เกิดขึิ้น",
                        image: "https://i.imgur.com/0RSqwsS.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 5",
                        subtitle: "ก่อนเข้านอน",
                        content: "ควรเดิมแค่ 1 แก้ว เพราะหากดื่มน้ำก่อนนอนในปริมาณที่มากจะทำให้นอนไม่เต็มอิ่มเนื่องจากต้องลุกไปเข้าห้องน้ำตลอดคืน แล้วทำไมต้องดื่มน้ำก่อนนอน ไม่กลัวปวดปัสสาวะตอนกลางคืนหรืออย่างไร ที่แนะนำให้ดื่มน้ำก่อนนอนนั้นก็เพราะว่า ป้องกันการเกิดสภาวะร่างกายขาดน้ำในขณะที่นอนหลับนั่นเอง ข้อแนะนำควรเดิมก่อนเข้านอนอย่างน้อย 1 ชม เพื่อป้องกันการตื่นมาปัสสาวะตอนกลางคืนทำให้นอนไม่หลับ แต่ถ้าใครเป็นคนที่ชอบตื่นมาเข้าห้องน่ำบ่อยเป็นปกติไม่แนะนำในช่วงเวลานี้",
                        image: "https://i.imgur.com/UkohlIj.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 6",
                        subtitle: "เมื่อรู้สึกว่าเป็นไข้ ไม่สบาย",
                        content: "เมื่อไรที่รู้สึกว่ากำลังจะไม่สบาย มีไข้ให้รีบดื่มน้ำไปเยอะๆ การดิ่มน้ำจะทำให้ร่างกายมีน้ำเพียงพอต่อระบบภูมิคุ้มกันต่างๆ คนที่ขาดน้ำเวลาเป็นไข้ก็จะเป็นหนักกว่าผู้คนทั่วไป รู้สึกเวียนหัวมากกว่าปกติ ไข้ก็หายช้าอ่อนเพลียรู้สึกกระหายน้ำ เพราะอุณหภูมิในร่างกายสูงทำให้ต้องการน้ำมากกว่าปกติ การดื่มน้ำมากๆจะช่วยขับความร้อนออกจากร่างกายทางปัสสาวะ",
                        image: "https://i.imgur.com/KLTfXpo.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 7",
                        subtitle: "ดื่มน้ำเมื่อรู้สึกอ่อนเพลีย",
                        content: "เมื่อรู้สึกเหนื่อย อ่อนเพลีย ไม่สดชื่น ลองหาน้ำเย็นๆมาดื่ม อาการต่างๆนั้นจะดีขึ้น ซึ่งเป็นแบบนั้นเพราะว่าร่างกายของเรานั้นอาจจะมีสภาวะขาดน้ำ ส่งผลให้มีอาการอ่อนเพลีย หงุดหงิดง่าย เหนื่อย เบื่อ ไม่อยากทำอะไร ดังนั้นลองหาน้ำมาดื่มดู อีกทั้งปริมาณที่ร่างกายของคนเราต้องการน้ำต่อวันคือ 2 ลิตร ถ้าดื่มน้อยกว่านั้นก็อาจจะส่งผลให้เกิดอาการดังกล่าวขึ้นได้",
                        image: "https://i.imgur.com/sZUPRSg.jpg"
                    },
                    {
                        title: "ช่วงเวลาที่ 8",
                        subtitle: "ช่วงที่ต้องไปอยู่ในบริเวณที่มีผู้ป่วยเยอะๆรอบตัว",
                        content: "เมื่อไหร่ที่เราต้องไปเยี่ยมผู้ป่วยตามโรงพยาบาลหรือแม้กระทั่งออกไปข้างนอก ให้เรารู้ไว้เลยว่าการดื่มน้ำจะกลายเป็นเกราะกำบังที่ดีของร่างกาย เพราะเมื่อดื่มน้ำเข้าไปก็จะเป็นการช่วยเสริมสร้างภูมคุ้มกันภายในร่างกายให้ทำงานได้ดียิ่งขึ้นมากกว่าเดิม พอภูมิคุ้มกันดีเชื้อโรคต่างๆ ก็จะไม่มีโอกาสเข้าสู่ร่างกายของเรา อีกทั้งการดื่มน้ำยังช่วยลดความเครียด ความอ่อนเพลียให้น้อยลง",
                        image: "https://i.imgur.com/qHnJWjZ.jpg"
                    }
                ]
            }
        }
    }
</script>